tomcat-quiz-1002.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-09 火 10:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tomcat-quiz-1002</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<h1 class="title">tomcat-quiz-1002</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08d3ea1">1. tomcat-quiz-1002</a>
<ul>
<li><a href="#org1bad100">1.1. 文書ナビゲーション</a></li>
<li><a href="#org27eeae2">1.2. 関連</a></li>
<li><a href="#orgf99038a">1.3. 出題</a></li>
<li><a href="#orgc78509a">1.4. 回答</a>
<ul>
<li><a href="#org1558f7f">1.4.1. 手順1</a></li>
<li><a href="#orgbe893b0">1.4.2. 手順2</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org08d3ea1" class="outline-2">
<h2 id="org08d3ea1"><span class="section-number-2">1</span> tomcat-quiz-1002</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1bad100" class="outline-3">
<h3 id="org1bad100"><span class="section-number-3">1.1</span> 文書ナビゲーション</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="index.html">index.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org27eeae2" class="outline-3">
<h3 id="org27eeae2"><span class="section-number-3">1.2</span> 関連</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>先行 <a href="tomcat-quiz-1001.html">tomcat-quiz-1001.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf99038a" class="outline-3">
<h3 id="orgf99038a"><span class="section-number-3">1.3</span> 出題</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>状況
<ul class="org-ul">
<li>サービス tomcat のステータスとログを見た。</li>
<li><p>
ログの内容。
</p>
<pre class="example">
Java HotSpot(TM) 64-Bit Server VM warning: INFO: os::commit_memory(0x000000044a660000, 14...rno=12)
Native memory allocation (mmap) failed to map 14857928704 bytes for committing reserved memory.
</pre></li>
</ul></li>
<li>問
<ul class="org-ul">
<li>サービス tomcat が起動しない理由は何か？</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc78509a" class="outline-3">
<h3 id="orgc78509a"><span class="section-number-3">1.4</span> 回答</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org1558f7f" class="outline-4">
<h4 id="org1558f7f"><span class="section-number-4">1.4.1</span> 手順1</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>free -h #=搭載メモリ量を把握する</li>
<li><p>
例
</p>
<pre class="example">
$ free -h #:搭載メモリ量を把握する
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgbe893b0" class="outline-4">
<h4 id="orgbe893b0"><span class="section-number-4">1.4.2</span> 手順2</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>サービス tomcat の JavaVM オプション ヒープサイズを把握する。</li>
<li><p>
例
</p>
<pre class="example">
$ grep Xm /usr/share/tomcat/conf/tomcat.conf #:サービス tomcat の JavaVM オプション ヒープサイズを把握する。
</pre></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-01-09 火 10:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
